In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,4,5]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  4
2  NaN  NaN  5

In [3]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [4]:
df.dropna(axis=1)

   C
0  1
1  4
2  5

In [5]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  4

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  4
2  NaN  NaN  5

In [11]:
df['A'].fillna(value=df['A'].mean(), inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  4
2  1.5  NaN  5

In [15]:
df['B'].fillna(method='ffill', inplace=True)

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  4
2  1.5  5.0  5